taskt/Core/Automation/Commands/UIAutomationGroup/IDoSomethingUIElementProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByTreeWalkerCommands" [ label="AChildrenSearchUIElementsFromUIElementByTreeWalkerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" [ label="IDoSomethingUIElementProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByXPathCommands" [ label="AChildrenSearchUIElementsFromUIElementByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands" [ label="ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands" [ label="ADoSomethingUIElementCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IGetFromUIElementProperties" [ label="IGetFromUIElementProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementActionProperties" [ label="IUIElementActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementSelectionItemsProperties" [ label="IUIElementSelectionItemsProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationSearchChildrenUIElementsInformationCommand" [ label="UIAutomationSearchChildrenUIElementsInformationCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchChildUIElementCommand" [ label="UIAutomationSearchChildUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchChildUIElementFromUIElementByXPathCommand" [ label="UIAutomationSearchChildUIElementFromUIElementByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationWaitForUIElementToExistsCommand" [ label="UIAutomationWaitForUIElementToExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationCheckUIElementExistsCommand" [ label="UIAutomationCheckUIElementExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromUIElementCommand" [ label="UIAutomationSearchUIElementFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands" [ label="AGetFromUIElementCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands" [ label="AUIElementActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationSearchChildrenUIElementsTreeXMLFromUIElementCommand" [ label="UIAutomationSearchChildrenUIElementsTreeXMLFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromUIElementCommand" [ label="UIAutomationSearchUIElementsTreeXMLFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetSelectionItemsValueFromUIElementCommand" [ label="UIAutomationGetSelectionItemsValueFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSelectItemInUIElementCommand" [ label="UIAutomationSelectItemInUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetTextsFromTableUIElementAsDataTableCommand" [ label="UIAutomationGetTextsFromTableUIElementAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromUIElementCommand" [ label="UIAutomationGetWindowUIElementFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetTableInformationFromUIElementCommand" [ label="UIAutomationGetTableInformationFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetScrollBarInformationFromUIElementCommand" [ label="UIAutomationGetScrollBarInformationFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetWindowHandleFromUIElementCommand" [ label="UIAutomationGetWindowHandleFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetWindowNameFromUIElementCommand" [ label="UIAutomationGetWindowNameFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetPropertyValueFromUIElementCommand" [ label="UIAutomationGetPropertyValueFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetUIElementPositionCommand" [ label="UIAutomationGetUIElementPositionCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetUIElementSizeCommand" [ label="UIAutomationGetUIElementSizeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetSelectedStateFromUIElementCommand" [ label="UIAutomationGetSelectedStateFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetUIElementFromTableUIElementCommand" [ label="UIAutomationGetUIElementFromTableUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetTextFromTableUIElementCommand" [ label="UIAutomationGetTextFromTableUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetTextFromUIElementCommand" [ label="UIAutomationGetTextFromUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetParentUIElementCommand" [ label="UIAutomationGetParentUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationScrollPercentUIElementCommand" [ label="UIAutomationScrollPercentUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSetSelectedStateToUIElementCommand" [ label="UIAutomationSetSelectedStateToUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationClickUIElementCommand" [ label="UIAutomationClickUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationExpandCollapseItemsInUIElementCommand" [ label="UIAutomationExpandCollapseItemsInUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationScrollUIElementCommand" [ label="UIAutomationScrollUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSelectUIElementCommand" [ label="UIAutomationSelectUIElementCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSetTextToUIElementCommand" [ label="UIAutomationSetTextToUIElementCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByTreeWalkerCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IGetFromUIElementProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementActionProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementSelectionItemsProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationSearchChildrenUIElementsInformationCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchChildUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchChildUIElementFromUIElementByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AChildrenSearchUIElementsFromUIElementByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationWaitForUIElementToExistsCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationCheckUIElementExistsCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromUIElementByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchChildrenUIElementsTreeXMLFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADoSomethingUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IGetFromUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementActionProperties";
"taskt.Core.Automation.Commands.UIAutomationGetSelectionItemsValueFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementSelectionItemsProperties";
"taskt.Core.Automation.Commands.UIAutomationSelectItemInUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementSelectionItemsProperties";
"taskt.Core.Automation.Commands.UIAutomationGetTextsFromTableUIElementAsDataTableCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetTableInformationFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetScrollBarInformationFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetWindowHandleFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetWindowNameFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetPropertyValueFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetUIElementPositionCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetUIElementSizeCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetSelectedStateFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetUIElementFromTableUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetSelectionItemsValueFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetTextFromTableUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetTextFromUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationGetParentUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AGetFromUIElementCommands";
"taskt.Core.Automation.Commands.UIAutomationScrollPercentUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationSetSelectedStateToUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationClickUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationExpandCollapseItemsInUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationScrollUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationSelectItemInUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationSelectUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
"taskt.Core.Automation.Commands.UIAutomationSetTextToUIElementCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands";
}
